document.getElementById("viewMore").addEventListener('click', (e) => {
    const moreInfo = `читателя.
    Въпреки че текстът самостоятелно не носи смисъл (или такъв е трудно да се намери), той има дълга,
    петвековна история. Lorem ipsum е стандарт в печатния набор още от началото на 16 век, когато
    неизвестен печатар взел една шпалта набран текст на латински, като избрал само част от набора думи,
    а някои от думите – не в тяхната цялост. Текстът бил взет от параграфи 1.10.32 – 3 от „De finibus
    bonorum et malorum“ („За границите на доброто и злото“), трактат на Цицерон върху теория на етиката.
    Пасажът „Lorem ipsum...“ е взет от оригиналния пасаж „Neque porro quisquam est qui dolorem ipsum
    quia dolor sit amet, consectetur, adipisci velit...“, което се превежда като „Няма никой, който да
    обича болката сама по себе си, да я търси и да иска да я изпитва, просто защото е болка...“`;

    const textNode = document.createTextNode(moreInfo);
    document.getElementById('extend-text').appendChild(textNode);

    const paragraph = document.createElement('p');
    paragraph.textContent = `Почти непроменен през последните пет века, текстът се използва и при навлизането на компютърните
    технологии в текстообработката и предпечатната подготовка. Съществуват версии на Lorem ipsum,
    съдържащи в добавка букви като k, w и z, които са несвойствени или изобщо липсват в латинския език.
    В Интернет могат да се намерят и генератори на текстове, подобни на Lorem ipsum, в които могат да се
    указват предпочитания за броя букви, думи и параграфи, за „езика“ и стила на dummy текста и др.`;
    e.target.parentNode.appendChild(paragraph);
    e.target.remove();
});
